<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>Fast SysTray - Site officiel</title>
<style type="text/css">
<!--
body {font-family: Arial, Helvetica, sans-serif;background-color:white;font-size:12px;}
h1 {color:red;font-size:14px;}
.Style2 {
    font-size: xx-large;
    font-weight: bold;
}
-->
</style>
</head>

<body>
<img src="logo.jpg" width="288" height="257" align="absmiddle" /><span class="Style2">Fast SysTray</span> <br />

<h1>Pr&eacute;sentation</h1>

<strong>Fast SysTray</strong> est un petit utilitaire qui se loge dans la barre de t&acirc;che &agrave; c&ocirc;t&eacute; de l'heure.<br />
Il permet d'acc&egrave;der <strong>rapidement</strong> &agrave; tous vos lecteurs, de les ejecter et les fermer, de quitter Windows plus rapidement (l'arr&ecirc;ter, le red&eacute;marrer, fermer sa session), de mettre votre ordinateur en veille ou en hibernation (veille prolong&eacute;e), de d&eacute;clencher l'&eacute;cran de veille et m&ecirc;me<strong> de verrouiller votre session</strong> !<br />

De plus, vous pouvez <strong>ajouter vos propre raccourcis</strong> dans le menu, &eacute;vitant ainsi de retourner sur le bureau.<br />
Fast SysTray &eacute;tend la boite de dialogue "Ex&eacute;cuter" en permettant de ne pas enregistrer la commande tapez et en permettant aussi, d'effacer l'historique, et vous permet de faire une copie d'&eacute;cran.<br />
Enfin, le menu Fast SysTray permet d'&ecirc;tre appel&eacute; par le clique droit sur l'ic&ocirc;ne dans la barre de t&acirc;che <strong>mais aussi par le clique gauche</strong>.<br />

En effet, un bug de Windows qui n'a toujours pas &eacute;t&eacute; corrig&eacute; &agrave; l'&eacute;criture de ces lignes (Windows XP SP1a) fait que lorsqu'on clique avec le bouton droit de la souris, le processeur monte en charge &agrave; 100%, faisant ainsi "ramer" l'ordinateur. Fast SysTray est un utilitaire qui fonctionne sous <strong>Windows 95, 98, Millennium &Eacute;dition, NT 4, 2000, XP, 2003</strong>.<br />
<br />
Il n&eacute;cessite <strong>seulement 1.30 Mo</strong> de disque dur, <strong>sources incluses</strong>.

<br /><br />
<big style="color:red">Le programme est arriv&eacute; a son terme. J'arr&ecirc;te donc le d&eacute;veloppement. Vous pouvez allez voir mes <a href="http://php4php.free.fr/">autres projets</a>.</big>

<h1>Caract&eacute;ristiques</h1>
<ul>
  <li>Support des versions 95 OSR-2, 98, Millennium &Eacute;dition, NT 4, 2000, XP, 2003,</li>
  <li>Support des th&egrave;mes de Windows XP,</li>
  <li>Sources liv&eacute;es avec le programmes sous licence GNU GPL,</li>

  <li>Affichage de tous les lecteurs pr&eacute;sents sur l'ordinateurs (y compris lecteurs r&eacute;seaux),</li>
  <li>Ejection/Fermeture des lecteurs de CR-ROM (et graveurs, DVD-ROM),</li>
  <li>Am&eacute;lioration de la boite de dialogue &quot;Ex&eacute;cuter&quot;,</li>
  <li>Logiciel programm&eacute; avec Borland Delphi 6 Standard (version 4 pour la 1.0.0),</li>

  <li> Place disque n&eacute;c&eacute;ssaire 1.30 Mo, </li>
  <li>M&eacute;moire vive n&eacute;c&eacute;ssaire  32 Mo minimum.</li>
</ul>

<h1>Nouveaut&eacute; de la version 1.1.4</h1>
<ul>
  <li>ajout de la possibilité de spécifier une icône,</li>
  <li>support des variables d'environnement dans le nom du programme, dans les arguments et le chemin d'îcone,</li>
  <li>suppression dans la base de registre des raccourcis supprimés,</li>
</ul>

<h1>Nouveaut&eacute; de la version 1.1.3</h1>
<ul>
  <li>correction d'un bug qui empêchait le switch user,</li>
  <li>correction du répertoire par défaut au lancement d'une application qui faisait créer des fichiers ini dans le répertoire de FST,</li>
  <li>possibilité de mettre le menu FST en haut du menu,</li>
  <li>possibilité de ne pas confirmer lorsqu'on arrête, redémarre Windows,</li>
</ul>


<h1>Nouveaut&eacute; de la version 1.1.2</h1>

<ul>
  <li>modification de l'icone de main,</li>
  <li>si on descendait un élément et qu'on arrivait en bout de liste, une erreur apparaissait,</li>
  <li>correction des mélange de raccourci lorsqu'on montait et descendait un élément dans la liste,</li>
  <li>suppression de la possibiliter de modifier une barre de séparation,</li>
  <li>possibilité de fermer les fenêtres par la touche ECHAP (ESC),</li>
  <li>amélioration de l'instalation.</li>
</ul>

<h1>Nouveaut&eacute; de la version 1.1.1</h1>

<ul>
  <li>correction d'un bug qui faisait mélanger les raccourcis,</li>
  <li>correction d'un bug qui faisait parfois ne pas supprimer l'icone en barre de tâche,</li>
  <li>ajout de la possibilité d'exporter/importer la configuration,</li>
  <li>possibilité d'ouvrir les lecteurs et répertoires dans une fenêtre et pas par l'explorateur,</li>
  <li>renommage du menu 'Arrêter Windows' en 'Windows',</li>
  <li>amélioration de la copie d'écran, capture réellement le curseur,</li>

  <li>mise à jour de la documentation (comment créer un lien Internet par exemple),</li>
  <li>ajout d'un menu 'Changer d'utilisateur',</li>
  <li>ajout de la possibilité de faire du drag&drop pour ajouter un lien,</li>
  <li>si on double clique sur un raccourci dans la liste des raccourcis, &eacute;dite le raccourci en question,</li>
  <li>amélioration de l'installation/désinstallation.</li>

</ul>

<h1>Nouveaut&eacute; de la version 1.1</h1>
<ul>
  <li>correction d'un bug qui enregistrait la liste de raccourci lorsqu'on cliquait sur Annuler,</li>
  <li>amélioration de la boite Exécuté : on peut spécifier sa position au démarrage, ne se lance qu'une fois, permet de lui dire de se fermer quand on lance la commande,</li>
  <li>amélioration des raccourcis. Lorsqu'on choisi un lien .LNK,</li>
  <li>suppression du recours à la TDriveListBox,</li>

  <li>remplacement de TabSheet pas TabbedNoteBook (plus légé),</li>
  <li>amélioration de la capture d'écran : programme externe, permet de sélectionner ce qu'on veut copier, qu'elle action déclanche la copie,</li>
  <li>suppression du message : "ShortCut0 existe déjà".</li>
</ul>

<h1>T&eacute;l&eacute;chargement</h1>
<a href="fst-1.1.4.exe">T&eacute;l&eacute;charger la version 1.1.4 de Fast SysTray - 1,34 Mo [18/02/2009]</a><br />

<br />Anciennes versions :<br />
<a href="fst-1.1.3.exe">T&eacute;l&eacute;charger la version 1.1.3 de Fast SysTray - 1,29 Mo [05/10/2005]</a><br />
<a href="fst-1.1.2.exe">T&eacute;l&eacute;charger la version 1.1.2 de Fast SysTray - 1,33 Mo [17/08/2005]</a><br />
<a href="fst-1.1.1.exe">T&eacute;l&eacute;charger la version 1.1.1 de Fast SysTray - 1,29 Mo [06/07/2005]</a><br />
<a href="fst-1.1.0.exe">T&eacute;l&eacute;charger la version 1.1.0 de Fast SysTray - 1,20 Mo [24/09/2004]</a><br />
<a href="fst-1.0.0.exe">T&eacute;l&eacute;charger la version 1.0.0 de Fast SysTray - 817 Ko [10/08/2004]</a>

<h1>Press</h1>

<h2>MicroHebdo n°373 Juin 2005</h2>
On aime : L'utilit&eacute;, la facilit&eacute; d'installation et d'utilisation, la gratuit&eacute;.<br />

On n'aime pas : Rien<br />
Mention : Tr&egrave;s bien<br />

<h1>Contact</h1>
Vous avez trouvé un bug ? Vous avez un idée d'amélioration ? Un suggestion ? Un petit mot gentil ?<br />
Vous souhaitez m'envoyer une petite contribution financière ?
<br /><br />
Ecrivez moi à <a href="mailto:php4php@free.fr">php4php@free.fr</a>

<h1>Licence</h1>

Ce logiciel est un logiciel libre; vous pouvez le redistribuer et/ou le modifier selon les termes de la licence <a href="gpl.htm">GNU General Public License (GNU GPL) </a>publi&eacute;es par la Free Software Foundation; en version 2 ou sup&eacute;rieur.
<p>Ce logiciel est distribu&eacute; en esp&eacute;rant qu'il vous sera utile, mais il est distribu&eacute; SANS AUCUNES GARANTIES de toutes sortes que ce soit; aussi bien dans le cadre d'une utilisation commercialle ou d'un particulier. Pour plus de d&eacute;tails, reportez-vous &agrave; la GNU General Public License qui vous a &eacute;t&eacute; fournie avec ce logiciel.</p>

<p>Si vous avez ce logiciel sans qu'il vous est fournit la licence GNU General Public license, reportez-vous au site de l'auteur  ou de la Free Software Foundation (<a target="_blank" href="http://www.fsf.org">http://www.fsf.org</a>) ou &eacute;crivez &agrave; :</p>
<p>Free Software Foundation, Inc., 59 Temple <br />
  Place, <br />
  Suite 330, Boston, MA 02111-1307 USA<br />
</p>
<a href="http://www.jesuislibre.org"><img border="0" src="jesuislibre.png" alt="JeSuisLibre.Org"></a>

<a href="http://www.lelogicielgratuit.com"><img border="0" src="logiciel-gatuit.png" alt="LeLogicielGratuit.com"></a>
<a href="http://www.planetesoft.com"><img border="0" src="planete-soft.png" alt="PlaneteSoft.Com"></a>
<a href="http://www.framasoft.net"><img border="0" src="framasoft.png" alt="FramaSoft.Net"></a>
</body>
</html>